In [1]:
#Task 1- Extracting tables from PDF and converting them into data frames with CSV format

In [1]:
# Step:1  Extracting all tables from the PDF File using 'camelot'

import camelot        #Importing camelot to extract the tables
import pandas as pd    #Importing pandas for dataframes handling

tables = camelot.read_pdf(r"C:\Users\Admin\Downloads\Capstone project.pdf", pages="all") #Storing them in 'Tables'
print("Tables found:", tables.n)

Tables found: 3

In [2]:
# Step:2   Saving each table as CSV files

tables[0].to_csv("Employee_DataFrame.csv") #Saving table as Employee_Dataframe.csv
tables[1].to_csv("Seniority_Level_DataFrame.csv") #Saving table as Seniority_Level_DataFrame.csv
tables[2].to_csv("Project_DataFrame.csv") #Saving table as Project_DataFrame.csv

In [3]:
# Step:3  Making Dataframes with correct names

employee_df = pd.read_csv("Employee_DataFrame.csv", header=1)
employee_df["Name"] = employee_df["Name"].str.replace("\n", " ", regex=False)

designation_df = pd.read_csv("Seniority_Level_DataFrame.csv", header=1)

designation_df.columns = designation_df.columns.str.strip()

if "Designation  Level" in designation_df.columns:   #while extracting the table, designation and level is separating hence renaming them as one
    designation_df = designation_df.rename(columns={"Designation  Level": "Designation Level"})

project_df = pd.read_csv("Project_DataFrame.csv", header=1)

In [4]:
# Step:4   Displaying all 3 dataframe tables 

print("\nEmployee DataFrame:")
print(employee_df)

print("\nSeniority Level DataFrame:")
print(designation_df)

print("\nProject DataFrame:")  #Printomh the Project Dataframe
print(project_df)

Employee DataFrame:
     ID              Name Gender     City  Age
0  A001        John Alter      M    Paris   25
1  A002  Alice  Luxumberg      F   London   27
2  A003    Tom  Sabestine      M   Berlin   29
3  A004        Nina Adgra      F  Newyork   31
4  A005        Amy  Johny      F   Madrid   30

Seniority Level DataFrame:
     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

Project DataFrame:
      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [5]:
# Task 2- Finding the missing values in the Data frame by running average

In [6]:
# Step:1  Loading the Project Data Frame from saved CSV Project_DataFrame

import numpy as np   #Importing Numpy for handling numerical values
project_df = pd.read_csv("Project_DataFrame.csv", header=1)

In [7]:
# Step:2    Converting Cost column to numbers

project_df["Cost"] = pd.to_numeric(project_df["Cost"], errors="coerce")  #Converting Cost column to numeric type

In [8]:
# Step:3   replacing missing values with running average

for i in range(len(project_df)):                     
    if pd.isna(project_df.loc[i, "Cost"]):           
        running_avg = project_df.loc[:i-1, "Cost"].mean()   # This will take average of available costs
        project_df.loc[i, "Cost"] = running_avg            
        print(f"Replaced missing cost at row {i} with running average: {running_avg}")  #Printing missed cost values

Replaced missing cost at row 4 with running average: 3250500.0
Replaced missing cost at row 8 with running average: 2210312.5

In [9]:
# Step:4  Showing DataFrames after replacing missing values and saving them as CSV
print("\nProject DataFrame with missing costs:")
project_df.to_csv("Project_DataFrame.csv", index=False)

print(project_df) #Printing complete Project Dataframe table with missed values

Project DataFrame with missing costs:
      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [10]:
#Task 3- Splitting the name column into two new columns and removing old Name column

In [11]:
#step:1 Separating Name into 2 different columns as 'First name' and 'Last name'

print("Before split:\n", employee_df)

employee_df[["First Name", "Last Name"]] = employee_df["Name"].str.split(" ", n=1, expand=True) 

# Step:2 Drop the old 'Name' column and print new table

employee_df.drop(columns=["Name"], inplace=True)  #Dropping Name column

print("\nAfter split:\n", employee_df)

Before split:
      ID              Name Gender     City  Age
0  A001        John Alter      M    Paris   25
1  A002  Alice  Luxumberg      F   London   27
2  A003    Tom  Sabestine      M   Berlin   29
3  A004        Nina Adgra      F  Newyork   31
4  A005        Amy  Johny      F   Madrid   30

After split:
      ID Gender     City  Age First Name   Last Name
0  A001      M    Paris   25       John       Alter
1  A002      F   London   27      Alice   Luxumberg
2  A003      M   Berlin   29        Tom   Sabestine
3  A004      F  Newyork   31       Nina       Adgra
4  A005      F   Madrid   30        Amy       Johny

In [12]:
#Task 4- Joining all 3 updated dataframes into 1 dataframe and naming it as 'Final'

In [13]:
#step:1 Merging employee dataframe with designation and project Dataframe

merged_df = pd.merge(employee_df, designation_df, on="ID", how="inner") #Merging Employee table with Designation table using Inner join method
Final = pd.merge(merged_df, project_df, on="ID", how="inner")  #Merging above table with project table with Inner join method

#step:2  Printing updated new table with all dataframes data

print("\nFinal DataFrame:") #Printing full table with 3 data frames
print(Final.to_string())

Final DataFrame:
      ID Gender     City  Age First Name   Last Name  Designation Level     Project       Cost    Status
0   A001      M    Paris   25       John       Alter                  2   Project 1  1002000.0  Finished
1   A001      M    Paris   25       John       Alter                  2   Project 9  2210312.5   Ongoing
2   A001      M    Paris   25       John       Alter                  2  Project 11  2000000.0    Failed
3   A002      F   London   27      Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing
4   A002      F   London   27      Alice   Luxumberg                  2   Project 6   680000.0    Failed
5   A003      M   Berlin   29        Tom   Sabestine                  3   Project 3  4500000.0  Finished
6   A003      M   Berlin   29        Tom   Sabestine                  3   Project 8   350000.0    Failed
7   A003      M   Berlin   29        Tom   Sabestine                  3  Project 10   300000.0  Finished
8   A004      F  Newyork   31       Nina       Adgra                  2   Project 4  5500000.0   Ongoing
9   A004      F  Newyork   31       Nina       Adgra                  2  Project 12  1000000.0   Ongoing
10  A004      F  Newyork   31       Nina       Adgra                  2  Project 13  3000000.0  Finished
11  A005      F   Madrid   30        Amy       Johny                  3   Project 5  3250500.0  Finished
12  A005      F   Madrid   30        Amy       Johny                  3   Project 7   400000.0  Finished
13  A005      F   Madrid   30        Amy       Johny                  3  Project 14   200000.0  Finished

In [14]:
#Task 5- Adding a new Bonus column with 5% bonus concerning project cost to employees who have finished the projects in the Final Table

In [15]:
# Step 1: Add Bonus column
Final["Bonus"] = Final.apply(
    lambda row: row["Cost"] * 0.05 if row["Status"] == "Finished" else 0, #Creating new column named 'Bonus' and adding 5% bonus for projects finished
    axis=1
)

# Step 2: Print updated DataFrame
print("\nFinal DataFrame with Bonus:")
print(Final.to_string())  # shows all rows

Final DataFrame with Bonus:
      ID Gender     City  Age First Name   Last Name  Designation Level     Project       Cost    Status     Bonus
0   A001      M    Paris   25       John       Alter                  2   Project 1  1002000.0  Finished   50100.0
1   A001      M    Paris   25       John       Alter                  2   Project 9  2210312.5   Ongoing       0.0
2   A001      M    Paris   25       John       Alter                  2  Project 11  2000000.0    Failed       0.0
3   A002      F   London   27      Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing       0.0
4   A002      F   London   27      Alice   Luxumberg                  2   Project 6   680000.0    Failed       0.0
5   A003      M   Berlin   29        Tom   Sabestine                  3   Project 3  4500000.0  Finished  225000.0
6   A003      M   Berlin   29        Tom   Sabestine                  3   Project 8   350000.0    Failed       0.0
7   A003      M   Berlin   29        Tom   Sabestine                  3  Project 10   300000.0  Finished   15000.0
8   A004      F  Newyork   31       Nina       Adgra                  2   Project 4  5500000.0   Ongoing       0.0
9   A004      F  Newyork   31       Nina       Adgra                  2  Project 12  1000000.0   Ongoing       0.0
10  A004      F  Newyork   31       Nina       Adgra                  2  Project 13  3000000.0  Finished  150000.0
11  A005      F   Madrid   30        Amy       Johny                  3   Project 5  3250500.0  Finished  162525.0
12  A005      F   Madrid   30        Amy       Johny                  3   Project 7   400000.0  Finished   20000.0
13  A005      F   Madrid   30        Amy       Johny                  3  Project 14   200000.0  Finished   10000.0

In [16]:
#Task 6- Demoting the designation level by 1 whose projects have status 'Fail' and deleting employee record whose designation is above 4

In [17]:
Final["Designation Level"] = Final["Designation Level"].astype(str).str.strip().astype(int)

# Demote by 1 wherever project Status is "Failed"
Final.loc[Final["Status"] == "Failed", "Designation Level"] -= 1

# Displaying the updated DataFrame
print("\nFinal DataFrame after demotion:")
print(Final.to_string())

Final DataFrame after demotion:
      ID Gender     City  Age First Name   Last Name  Designation Level     Project       Cost    Status     Bonus
0   A001      M    Paris   25       John       Alter                  2   Project 1  1002000.0  Finished   50100.0
1   A001      M    Paris   25       John       Alter                  2   Project 9  2210312.5   Ongoing       0.0
2   A001      M    Paris   25       John       Alter                  1  Project 11  2000000.0    Failed       0.0
3   A002      F   London   27      Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing       0.0
4   A002      F   London   27      Alice   Luxumberg                  1   Project 6   680000.0    Failed       0.0
5   A003      M   Berlin   29        Tom   Sabestine                  3   Project 3  4500000.0  Finished  225000.0
6   A003      M   Berlin   29        Tom   Sabestine                  2   Project 8   350000.0    Failed       0.0
7   A003      M   Berlin   29        Tom   Sabestine                  3  Project 10   300000.0  Finished   15000.0
8   A004      F  Newyork   31       Nina       Adgra                  2   Project 4  5500000.0   Ongoing       0.0
9   A004      F  Newyork   31       Nina       Adgra                  2  Project 12  1000000.0   Ongoing       0.0
10  A004      F  Newyork   31       Nina       Adgra                  2  Project 13  3000000.0  Finished  150000.0
11  A005      F   Madrid   30        Amy       Johny                  3   Project 5  3250500.0  Finished  162525.0
12  A005      F   Madrid   30        Amy       Johny                  3   Project 7   400000.0  Finished   20000.0
13  A005      F   Madrid   30        Amy       Johny                  3  Project 14   200000.0  Finished   10000.0

In [18]:
#Task-7 Adding'Mr.' and 'Mrs.' to the first name and deleting Gender column

In [19]:
# Add title (Mr./Mrs.) to First Name based on Gender
Final["First Name"] = Final.apply(
    lambda row: "Mr. " + row["First Name"] if row["Gender"] == "M" else "Mrs. " + row["First Name"],
    axis=1                   #Adding Prefix to first name column
)

# Droping the Gender column
Final.drop(columns=["Gender"], inplace=True)

# Displaying updated DataFrame
print("\nFinal DataFrame after adding titles and dropping Gender:")
print(Final.to_string())

Final DataFrame after adding titles and dropping Gender:
      ID     City  Age  First Name   Last Name  Designation Level     Project       Cost    Status     Bonus
0   A001    Paris   25    Mr. John       Alter                  2   Project 1  1002000.0  Finished   50100.0
1   A001    Paris   25    Mr. John       Alter                  2   Project 9  2210312.5   Ongoing       0.0
2   A001    Paris   25    Mr. John       Alter                  1  Project 11  2000000.0    Failed       0.0
3   A002   London   27  Mrs. Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing       0.0
4   A002   London   27  Mrs. Alice   Luxumberg                  1   Project 6   680000.0    Failed       0.0
5   A003   Berlin   29     Mr. Tom   Sabestine                  3   Project 3  4500000.0  Finished  225000.0
6   A003   Berlin   29     Mr. Tom   Sabestine                  2   Project 8   350000.0    Failed       0.0
7   A003   Berlin   29     Mr. Tom   Sabestine                  3  Project 10   300000.0  Finished   15000.0
8   A004  Newyork   31   Mrs. Nina       Adgra                  2   Project 4  5500000.0   Ongoing       0.0
9   A004  Newyork   31   Mrs. Nina       Adgra                  2  Project 12  1000000.0   Ongoing       0.0
10  A004  Newyork   31   Mrs. Nina       Adgra                  2  Project 13  3000000.0  Finished  150000.0
11  A005   Madrid   30    Mrs. Amy       Johny                  3   Project 5  3250500.0  Finished  162525.0
12  A005   Madrid   30    Mrs. Amy       Johny                  3   Project 7   400000.0  Finished   20000.0
13  A005   Madrid   30    Mrs. Amy       Johny                  3  Project 14   200000.0  Finished   10000.0

In [20]:
#Task-8 promoting designation level by 1 for the age above 29 using IF condition

In [21]:
Final["Designation Level"] = Final.apply(
    lambda row: row["Designation Level"] + 1 if row["Age"] > 29 else row["Designation Level"], #Promoting the designation by 1 for age above 29
    axis=1
)

# Displaying updated DataFrame
print("\nFinal DataFrame after promotion for Age > 29:")
print(Final.to_string())

Final DataFrame after promotion for Age > 29:
      ID     City  Age  First Name   Last Name  Designation Level     Project       Cost    Status     Bonus
0   A001    Paris   25    Mr. John       Alter                  2   Project 1  1002000.0  Finished   50100.0
1   A001    Paris   25    Mr. John       Alter                  2   Project 9  2210312.5   Ongoing       0.0
2   A001    Paris   25    Mr. John       Alter                  1  Project 11  2000000.0    Failed       0.0
3   A002   London   27  Mrs. Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing       0.0
4   A002   London   27  Mrs. Alice   Luxumberg                  1   Project 6   680000.0    Failed       0.0
5   A003   Berlin   29     Mr. Tom   Sabestine                  3   Project 3  4500000.0  Finished  225000.0
6   A003   Berlin   29     Mr. Tom   Sabestine                  2   Project 8   350000.0    Failed       0.0
7   A003   Berlin   29     Mr. Tom   Sabestine                  3  Project 10   300000.0  Finished   15000.0
8   A004  Newyork   31   Mrs. Nina       Adgra                  3   Project 4  5500000.0   Ongoing       0.0
9   A004  Newyork   31   Mrs. Nina       Adgra                  3  Project 12  1000000.0   Ongoing       0.0
10  A004  Newyork   31   Mrs. Nina       Adgra                  3  Project 13  3000000.0  Finished  150000.0
11  A005   Madrid   30    Mrs. Amy       Johny                  4   Project 5  3250500.0  Finished  162525.0
12  A005   Madrid   30    Mrs. Amy       Johny                  4   Project 7   400000.0  Finished   20000.0
13  A005   Madrid   30    Mrs. Amy       Johny                  4  Project 14   200000.0  Finished   10000.0

In [22]:
#Task 9- Adding the cost of all projects for each employee and saving it in new dataframe "TotalProjCost" with columns ID, First and last name

In [23]:
# Create=ing new dataframe with total project cost per employee
TotalProjCost = Final.groupby(["ID", "First Name"])["Cost"].sum().reset_index()

# Renaming the 'Cost' column to 'Total cost'
TotalProjCost.rename(columns={"Cost": "Total cost"}, inplace=True)

# Displaying the new dataframe
print("\nTotalProjCost DataFrame:")
print(TotalProjCost.to_string())

TotalProjCost DataFrame:
     ID  First Name  Total cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [24]:
#Task 10- Printing all the employee details whose city name have letter 'o'

In [25]:
employees_with_o = Final[Final["City"].str.contains("o", case=False)]  #Filtering the employees whose city name have 'o'

print("\nEmployees whose city name contains 'o':") #Displaying filtered table
print(employees_with_o.to_string())

Employees whose city name contains 'o':
      ID     City  Age  First Name   Last Name  Designation Level     Project       Cost    Status     Bonus
3   A002   London   27  Mrs. Alice   Luxumberg                  2   Project 2  2000000.0   Ongoing       0.0
4   A002   London   27  Mrs. Alice   Luxumberg                  1   Project 6   680000.0    Failed       0.0
8   A004  Newyork   31   Mrs. Nina       Adgra                  3   Project 4  5500000.0   Ongoing       0.0
9   A004  Newyork   31   Mrs. Nina       Adgra                  3  Project 12  1000000.0   Ongoing       0.0
10  A004  Newyork   31   Mrs. Nina       Adgra                  3  Project 13  3000000.0  Finished  150000.0